#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
data.google_iam_policy.server_invoke_public: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_artifact_registry_repository.server must be replaced
-/+ resource "google_artifact_registry_repository" "server" {
!       create_time   = "2022-09-09T10:54:06.520106Z" -> (known after apply)
!       id            = "projects/clubrizer-com/locations/europe-west3/repositories/server" -> (known after apply)
+       kms_key_name  = "clubrizer-artifact-registry-key" # forces replacement
-       labels        = {} -> null
!       name          = "server" -> (known after apply)
!       project       = "clubrizer-com" -> (known after apply)
!       update_time   = "2022-09-09T10:54:06.520106Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # google_kms_crypto_key.server_registry_key will be created
+   resource "google_kms_crypto_key" "server_registry_key" {
+       destroy_scheduled_duration = (known after apply)
+       id                         = (known after apply)
+       import_only                = (known after apply)
+       key_ring                   = (known after apply)
+       name                       = "clubrizer-artifact-registry-key"
+       purpose                    = "ENCRYPT_DECRYPT"
+       rotation_period            = "86400s"

+       version_template {
+           algorithm        = (known after apply)
+           protection_level = (known after apply)
        }
    }

  # google_kms_key_ring.server_registry will be created
+   resource "google_kms_key_ring" "server_registry" {
+       id       = (known after apply)
+       location = "global"
+       name     = "clubrizer-artifact-registry"
+       project  = (known after apply)
    }

  # google_storage_bucket.backend will be updated in-place
!   resource "google_storage_bucket" "backend" {
        id                          = "clubrizer-com-tfstate"
        name                        = "clubrizer-com-tfstate"
!       uniform_bucket_level_access = false -> true
        # (10 unchanged attributes hidden)

+       logging {
+           log_bucket = "clubrizer-com-access-logs"
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @KatharinaSick, Action: `pull_request`, Working Directory: ``, Workflow: `Verify Changes`*